KevinWangJian/DuPower_SPC5775B_EMS/Targets/SPC5775B/MCAL/modules/Adc/include/Adc.h
#if (ADC_SET_MODE_API == STD_ON)     
/**
* @brief   An error occurred when the Adc_SetMode services is used.
* */    
#define ADC_E_SET_MODE                               ((uint8)0x21U)
#endif        
                                       
#if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)   
/**
* @brief   Wrong trigger source to be used for the group.
* */      
#define ADC_E_PARAM_TRIGGER                          ((uint8)0x22U)
#endif

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
/**
* @brief   Adc_EnableChannel or Adc_DisableChannel services called with a wrong channel.
* */   
/** @violates @ref Adc_h_REF_3 Identifier exceeds 31 characters */
#define ADC_E_WRONG_ENABLE_CH_DISABLE_CH_GROUP       ((uint8)0x23U)
/**
* @brief   Adc_EnableChannel or Adc_DisableChannel services called with a wrong channel identifier (ID).
* */  
/** @violates @ref Adc_h_REF_3 Identifier exceeds 31 characters */
#define ADC_E_WRONG_ENABLE_CH_DISABLE_CH_ID          ((uint8)0x24U)
#endif

#if (ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON)
/**
* @brief   Adc_ConfigureThreshold service is called for a wrong group.
* */  
#define ADC_E_WRONG_CONF_THRHLD_GROUP                ((uint8)0x25U)
/**
* @brief   Adc_ConfigureThreshold service is called using wrong values.
* */ 
#define ADC_E_WRONG_CONF_THRHLD_VALUE                ((uint8)0x26U)
#endif

/**
* @brief   API service called using a wrong ADC unit.
* */ 
#define ADC_E_PARAM_UNIT                             ((uint8)0x27U)

#if (ADC_CTUV2_ENABLE_TRIGGER_CONFIGURATION_APIS == STD_ON)
/**
* @brief   API service called using a wrong CTU trigger.
* */ 
#define ADC_E_WRONG_CTUV2_TRIGGER                    ((uint8)0x28U)
/**
* @brief   API service called using a wrong CTU CLCR trigger.
* */ 
#define ADC_E_WRONG_CTUV2_CLCR_TRIGGER               ((uint8)0x29U)
#endif

#if (ADC_DUAL_CLOCK_MODE == STD_ON)
/**
* @brief   Adc_SetClockMode service called using an invalid clock mode.
* */ 
#define ADC_E_INVALID_CLOCK_MODE                     ((uint8)0x2AU)
#endif

#if (ADC_SETCHANNEL_API == STD_ON)
/**
* @brief   Adc_SetChannel service called using an invalid channel list.
* */ 
#define ADC_E_PARAM_CHANNEL                          ((uint8)0x2BU)
#endif


#define ADC_E_BUFFER_UNINIT_LIST                     ((uint32)0x00000001U)
#define ADC_E_WRONG_TRIGG_SRC_LIST                   ((uint32)0x00000002U)
#define ADC_E_QUEUE_FULL_LIST                        ((uint32)0x00000004U)
#define ADC_E_WRONG_CONV_MODE_LIST                   ((uint32)0x00000008U)
/** @violates @ref Adc_h_REF_3 Identifier exceeds 31 characters */
#define ADC_E_WRONG_ENABLE_CH_DISABLE_CH_GROUP_LIST  ((uint32)0x00000010U)
/** @violates @ref Adc_h_REF_3 Identifier exceeds 31 characters */
#define ADC_E_WRONG_ENABLE_CH_DISABLE_CH_ID_LIST     ((uint32)0x00000020U)
#define ADC_E_SET_MODE_LIST                          ((uint32)0x00000040U)

/**
          All AUTOSAR API's service IDs
*/

/**
* @brief API service ID for Adc_Init function
* */
#define ADC_INIT_ID                                  0x00U

/**
* @brief API service ID for Adc_DeInit function
* */
#define ADC_DEINIT_ID                                0x01U

/**
* @brief API service ID for Adc_StartGroupConversion function
* */
#define ADC_STARTGROUPCONVERSION_ID                  0x02U

/**
* @brief API service ID for Adc_StopGroupConversion function
* */
#define ADC_STOPGROUPCONVERSION_ID                   0x03U

/**
* @brief API service ID for Adc_ReadGroup function
* */
#define ADC_VALUEREADGROUP_ID                        0x04U

/**
* @brief API service ID for Adc_EnableHardwareTrigger function
* */
#define ADC_ENABLEHARDWARETRIGGER_ID                 0x05U

/**
* @brief API service ID for Adc_DisableHardwareTrigger function
* */
#define ADC_DISABLEHARDWARETRIGGER_ID                0x06U

/**
* @brief API service ID for Adc_EnableGroupNotification function
* */
#define ADC_ENABLEGROUPNOTIFICATION_ID               0x07U

/**
* @brief API service ID for Adc_DisableGroupNotification function
* */
#define ADC_DISABLEGROUPNOTIFICATION_ID              0x08U

/**
* @brief API service ID for Adc_GetGroupStatus function
* */
#define ADC_GETGROUPSTATUS_ID                        0x09U

/**
* @brief API service ID for Adc_GetVersionInfo function
* */
#define ADC_GETVERSIONINFO_ID                        0x0AU

/**
* @brief API service ID for Adc_GetStreamLastPointer function
* */
#define ADC_GETSTREAMLASTPOINTER_ID                  0x0BU

/**
* @brief API service ID for Adc_SetupResultBuffer function
* */
#define ADC_SETUPRESULTBUFFER_ID                     0x0CU

/**
*        All non AUTOSAR API's service IDs
**       NOTE: Parameters used when raising an error/exception
*/

#if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
/**
* @brief API service ID for Adc_HwResultReadGroup function
* */ 
#define ADC_HWRESULTREADGROUP_ID                     0x20U
/**
* @brief API service ID for Adc_EnableCTUTrigge function
* */ 
#define ADC_ENABLECTUTRIGGER_ID                      0x21U
/**
* @brief API service ID for Adc_DisableCTUTrigger function
* */ 
#define ADC_DISABLECTUTRIGGER_ID                     0x22U
#endif        
                                       
#if (ADC_SET_MODE_API == STD_ON)    
/**
* @brief API service ID for Adc_SetMode function
* */    
#define ADC_SETMODE_ID                               0x23U
#endif

#if (ADC_DUAL_CLOCK_MODE == STD_ON)
/**
* @brief API service ID for Adc_SetClockMode function
* */
#define ADC_SETCLOCKMODE_ID                          0x24U
#endif

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON)
/**
* @brief API service ID for Adc_EnableChannel function
* */
#define ADC_ENABLE_CHANNEL_ID                        0x25U
/**
* @brief API service ID for Adc_DisableChannel function
* */
#define ADC_DISABLE_CHANNEL_ID                       0x26U
#endif

#if (ADC_GET_INJECTED_CONVERSION_STATUS_API == STD_ON)
/**
* @brief API service ID for Adc_GetInjectedConversionStatus function
* */
#define ADC_GETINJECTEDCONVERSIONSTATUS_ID           0x27U
#endif

#if (ADC_CALIBRATION == STD_ON)
/**
* @brief API service ID for Adc_Calibrate function
* */
#define ADC_CALIBRATE_ID                             0x28U
#endif

#if (ADC_SELF_TEST == STD_ON)
#define ADC_SELFTEST_ID                              0x29U
#endif

#if (ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON)
/**
* @brief API service ID for Adc_ConfigureThreshold function
* */    
#define ADC_CONFIGURE_THRESHOLD_ID                   0x2AU
#endif

#if (ADC_CTUV2_ENABLE_TRIGGER_CONFIGURATION_APIS == STD_ON)
/**
* @brief API service ID for Adc_SetCtu2TriggerHandlerCtrlRegs function
* */
#define ADC_CTUV2_SET_TRG_HANDLER_CTRL_REGS_ID              (0x2BU)
/**
* @brief API service ID for Adc_Ctu2TriggerHandlerCtrlRegsEnableDisable function
* */
#define ADC_CTUV2_EN_DIS_TRG_HANDLER_CTRL_REGS_ID                 (0x2CU)
/**
* @brief API service ID for ADC_CTUV2_SET_CMD_LIST_HANDLER_CTRL_REGS function
* */
/** @violates @ref Adc_h_REF_3 Identifier exceeds 31 characters */
#define ADC_CTUV2_SET_CMD_LIST_HANDLER_CTRL_REGS_ID             (0x2DU)
/**
* @brief API service ID for Adc_SetCtu2TriggerCompareRegs function
* */
/** @violates @ref Adc_h_REF_3 Identifier exceeds 31 characters */
#define ADC_CTUV2_SET_TRIGGER_COMPARE_REGS_ID        (0x2EU)
#endif

